In [2]:
import pandas as pd
import requests

In [20]:
df = pd.read_csv("fireflies.csv")
df.head()
df.columns

Index(['Year', 'Habitat ID', 'Latitude', 'Longitude', 'State', 'Country',
       'Location', 'Your Backyard?', 'Grassy', 'Wetland', 'Forest',
       'Open/Unmowed', 'Cropland', 'Pasture', 'Beach',
       'Hedge Rows/Thick Shrubs', 'Scattered Shrubs', 'Tall Grass',
       'Flowerbeds', 'Ornamentals', 'No Low Vegetation', 'Tree Type',
       'Creek/River (yards away)', 'Pond/Lake (yards away)',
       'Freshwater Marsh (yards away)', 'Salt Water Marsh (yards away)',
       'Agricultural Field (yards away)', 'Cultivated Bog (yards away)',
       'Golf Course (yards away)', 'Swimming Pool (yards away)',
       'Man-made Pool (yards away)', 'Ocean (yards away)',
       'Is the Grass Mowed?', 'Fertilized', 'Weed Killer', 'Pesticides',
       'Cast Light', 'Street Light (yards away)', 'Light Source (yards away)',
       'Observation Date', 'Temperature (F)', 'Number Seen in 10 s',
       'Precipitation', 'Moonlight', 'Windspeed (MPH)', 'Different Colors',
       'Different Flash Patterns', 'Field Location', 'Clouds', 'Color',
       'Flash Pattern', 'Fly Location', 'Fly J-Shape'],
      dtype='object')

In [21]:
df = df[['Year', 'Latitude', 'Longitude', 'Observation Date', 'Country', 'State']]
df.head()

   Year  Latitude  Longitude Observation Date Country State
0  2008   42.3683   -71.0716    5/22/08 18:15      US    MA
1  2008   42.3683   -71.0716    6/16/08 23:30      US    MA
2  2008   42.3683   -71.0716     7/7/08 19:15      US    MA
3  2008   42.3683   -71.0716      7/8/08 1:00      US    MA
4  2008   42.3683   -71.0716      7/8/08 3:15      US    MA

In [22]:
#keep only US
df = df[df['Country'] == 'US']
df.Latitude.describe()

count    39076.000000
mean        39.448764
std          3.322534
min         25.322400
25%         38.700500
50%         39.841900
75%         42.059200
max         47.903800
Name: Latitude, dtype: float64

In [30]:
df.Longitude.describe()

count    39076.000000
mean       -81.666493
std          7.851825
min       -122.073000
25%        -89.444500
50%        -80.198700
75%        -75.601825
max        -67.693800
Name: Longitude, dtype: float64

In [12]:
#split date var
df[['date', 'time']] = df['Observation Date'].str.split(" ", 1, expand = True)

In [43]:
df.shape

(39076, 7)

In [55]:
#don't need exact duplicates, do i?
df2 = df.drop_duplicates(keep=False)
df2.shape

(14810, 7)

In [57]:
#below file is mildly edited in google sheets 
df2.to_csv('fireflies5.csv', index = False)

In [4]:
#now to create a df for analysis
df = pd.read_csv("fireflies.csv")
df = df[df['Country'] == 'US']
df = df[['Year', 'Latitude', 'Longitude', 'Observation Date', 'State']]
df.head()

   Year  Latitude  Longitude Observation Date State
0  2008   42.3683   -71.0716    5/22/08 18:15    MA
1  2008   42.3683   -71.0716    6/16/08 23:30    MA
2  2008   42.3683   -71.0716     7/7/08 19:15    MA
3  2008   42.3683   -71.0716      7/8/08 1:00    MA
4  2008   42.3683   -71.0716      7/8/08 3:15    MA

In [6]:
#export with states for cleaning and analysis. 
df.to_csv('fireflystates.csv', index = False)

In [7]:
df.State.value_counts()

IL                                   6062
MA                                   4468
PA                                   3157
VA                                   2869
NC                                   2519
OH                                   2265
NY                                   2168
MI                                   2108
NJ                                   1192
TX                                   1156
MD                                   1117
MO                                    944
NH                                    849
GA                                    596
IN                                    570
CT                                    521
FL                                    515
WI                                    480
WV                                    475
SC                                    436
MN                                    433
TN                                    408
RI                                    408
ME                                    350
KY                                    341
VT                                    336
LA                                    328
IA                                    268
NE                                    256
AL                                    242
KS                                    236
CO                                    225
AR                                    218
OK                                    194
MS                                    142
DE                                     51
DC                                     48
UT                                     40
SD                                     24
AZ                                     10
CA                                      9
WY                                      9
NM                                      9
W Virginia                              6
├½┬⌐ΓÇ¥├½┬ª┬┤├½┼╛┼ô├½ΓÇ£┼ô ├¼┬ú┬╝       3
S Dakota                                2
Mt                                      1
├ú╞Æ┼╕├úΓÇÜ┬║├ú╞Æ┬╝├ú╞Æ┬¬               1
WA                                      1
Name: State, dtype: int64

In [13]:
df.head()

   Year  Latitude  Longitude Observation Date Country     date   time
0  2008   42.3683   -71.0716    5/22/08 18:15      US  5/22/08  18:15
1  2008   42.3683   -71.0716    6/16/08 23:30      US  6/16/08  23:30
2  2008   42.3683   -71.0716     7/7/08 19:15      US   7/7/08  19:15
3  2008   42.3683   -71.0716      7/8/08 1:00      US   7/8/08   1:00
4  2008   42.3683   -71.0716      7/8/08 3:15      US   7/8/08   3:15

In [24]:
df.State.value_counts()

IL                                   6062
MA                                   4468
PA                                   3157
VA                                   2869
NC                                   2519
OH                                   2265
NY                                   2168
MI                                   2108
NJ                                   1192
TX                                   1156
MD                                   1117
MO                                    944
NH                                    849
GA                                    596
IN                                    570
CT                                    521
FL                                    515
WI                                    480
WV                                    475
SC                                    436
MN                                    433
TN                                    408
RI                                    408
ME                                    350
KY                                    341
VT                                    336
LA                                    328
IA                                    268
NE                                    256
AL                                    242
KS                                    236
CO                                    225
AR                                    218
OK                                    194
MS                                    142
DE                                     51
DC                                     48
UT                                     40
SD                                     24
AZ                                     10
CA                                      9
WY                                      9
NM                                      9
W Virginia                              6
├½┬⌐ΓÇ¥├½┬ª┬┤├½┼╛┼ô├½ΓÇ£┼ô ├¼┬ú┬╝       3
S Dakota                                2
Mt                                      1
├ú╞Æ┼╕├úΓÇÜ┬║├ú╞Æ┬╝├ú╞Æ┬¬               1
WA                                      1
Name: State, dtype: int64